Комплексная_автоматизация_2_МОМ_2019/src/DataProcessors/ПанельСправочниковПроизводство/ПанельСправочниковПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПанельСправочниковПроизводство</name>
</mdclass:DataProcessor>

Комплексная_автоматизация_2_МОМ_2019/src/Catalogs/СтруктураПредприятия/СтруктураПредприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураПредприятия</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ТекущийРуководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОбособленногоУчетаТоваров</name>
    <type>
      <types>EnumRef.ВариантыОбособленногоУчетаТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетСтруктуреЮридическихЛиц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПланирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоИнтервалаПланирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеИнтервалаПланирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УправлениеМаршрутнымиЛистами</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеДоступностиДляРасписанияРЦКоличествоИнтервалов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеДоступностиДляРасписанияРЦНапоминаниеДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеДоступностиДляГрафикаПроизводстваКоличествоИнтервалов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПооперационногоУправления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеДоступностиДляГрафикаПроизводстваНапоминаниеДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеДиспетчер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерииНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНаРегистрациюВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНаРегистрациюВыполненияЕдИзм</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьСебестоимостьПоСериям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводствоПоЗаказам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводствоБезЗаказов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяСписаниеЗатратНаВыпуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПолученияПолуфабрикатов</name>
    <type>
      <types>EnumRef.СпособыПолученияПолуфабрикатовПроизводимыхВПроцессе</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПооперационноеУправление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьМатериалыВОперациях</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВыходныеИзделияВОперациях</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПооперационноеПланирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьОформленияВыработки</name>
    <type>
      <types>EnumRef.ПериодичностьОформленияВыработкиСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКТУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьТарифныеСтавки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОтработанноеВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБригадныеНаряды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПерсональныеНаряды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособНастройкиГрафикаРаботы</name>
    <type>
      <types>EnumRef.СпособыНастройкиГрафикаРаботыПодразделений</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСменныеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроизводственныеУчастки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ГрафикиРаботы</name>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.Календари</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Комплексная_автоматизация_2_МОМ_2019/src/DataProcessors/ПанельСправочниковПроизводство/Forms/ПанельСправочниковПроизводство/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	УправлениеЭлементами();
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_НаборКонстант" Тогда
		// Изменены настройки программы в панелях администрирования
		УправлениеЭлементами();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьСтруктуруПредприятия(Команда)
	
	ПараметрыФормы = Новый Структура("ТолькоПроизводственныеПодразделения", Истина);
	ОткрытьФорму("Справочник.СтруктураПредприятия.ФормаСписка", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКалендари(Команда)
	
	ОткрытьФорму("Справочник.Календари.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПриоритетыЗаказов(Команда)
	
	ОткрытьФорму("Справочник.Приоритеты.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОчередьПроизводственныхПодразделений(Команда)
	
	ОткрытьФорму("Справочник.СтруктураПредприятия.Форма.НастройкаПриоритетовПроизводственныхПодразделений", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПричиныЗадержкиВыполненияЭтаповПроизводства(Команда)
	
	Возврат; // в КА2 не используется
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПараметрыМежоперационныхПереходов(Команда)
	
	Возврат; // в КА2 не используется
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПричиныОтменыПроизводства(Команда)
	
	Возврат; // в КА2 не используется
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМоделиПооперационногоПланирования(Команда)
	
	Возврат; // в КА2 не используется
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСценарииПооперационногоПланирования(Команда)
	
	Возврат; // в КА2 не используется
	
КонецПроцедуры

#Область Ремонты

&НаКлиенте
Процедура ОткрытьКлассыОбъектовЭксплуатации(Команда)
	
	Возврат; // в КА2 не используется

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбщиеВидыРемонтов(Команда)
	
	Возврат; // в КА2 не используется

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВидыДефектов(Команда)
	
	Возврат; // в КА2 не используется
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПоказателиНаработки(Команда)
	
	Возврат; // в КА2 не используется
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеЭлементами()
	
	УправлениеПредприятием = ПолучитьФункциональнуюОпцию("УправлениеПредприятием");
	
	#Область ПроизводственнаяСтруктура
	
	//
	ПравоДоступаПодразделения = ПравоДоступа("Просмотр", Метаданные.Справочники.СтруктураПредприятия);
	Элементы.ГруппаСтруктураПредприятия.Видимость = ПравоДоступаПодразделения;
	
	//
	ПравоДоступаРабочиеЦентры  = Ложь;
	Элементы.ГруппаСтруктураРабочихЦентров.Видимость = ПравоДоступаРабочиеЦентры И УправлениеПредприятием;
	
	//
	ПравоДоступаКалендари = ПравоДоступа("Просмотр", Метаданные.Справочники.Календари);
	Элементы.ГруппаКалендари.Видимость = ПравоДоступаКалендари;
	
	// Заголовок группы
	Элементы.ГруппаПроизводственнаяСтруктура.Видимость =
		ПравоДоступаПодразделения
		ИЛИ ПравоДоступаРабочиеЦентры
		ИЛИ ПравоДоступаКалендари;
	#КонецОбласти
	
	#Область МежцеховоеУправление
	
	Элементы.ОткрытьПриоритетыЗаказов.Видимость = УправлениеПредприятием
		И ПравоДоступа("Просмотр", Метаданные.Справочники.Приоритеты);
	
	Элементы.ОткрытьНастройкуОчередиПроизводственныхПодразделений.Видимость = УправлениеПредприятием
		И ПравоДоступа("Просмотр", Метаданные.Справочники.СтруктураПредприятия);
	
	#КонецОбласти
	
	#Область ВнутрицеховоеУправление
	
	// Заголовок группы
	
	Элементы.ГруппаВнутрицеховоеУправление.ОтображатьЗаголовок = 
		УправлениеПредприятием
			;
	
	Элементы.ГруппаВнутрицеховоеУправление.Видимость = 
		УправлениеПредприятием
			;
	#КонецОбласти
	
	#Область Ремонты
	
	Элементы.ОткрытьКлассыОбъектовЭксплуатации.Видимость = УправлениеПредприятием
		;
	
	Элементы.ОткрытьОбщиеВидыРемонтов.Видимость = УправлениеПредприятием
		;
	
	Элементы.ОткрытьВидыДефектов.Видимость = УправлениеПредприятием
		;
	
	Элементы.ОткрытьПоказателиНаработки.Видимость = УправлениеПредприятием
		;
	
	#КонецОбласти
	
КонецПроцедуры

#КонецОбласти
